// This file contains the initial CSV data for seeding the database.

export const koujiCsvData = `
予報ID,工事ID,工事名,発注者,場所,工期（開始）,工期（終了）,発注担当,代理人区分
2023-CS1750,231-320,110kV彦島支線２回線化工事,山口・送電第一課,山口,2024/01/19,2026/03/23,酒井　巧海,架空送電Ｂ
2023-C1946,231-444,220kV新徳山幹線No.203～新徳山（変）除却工事,周南・送電課,山口,2024/05/13,2028/03/30,白須　充啓,架空送電Ｂ
,241-184,66kV鋳銭司線２回線化に伴う管路工事(No.5～No.6TW),山口・送電第一課,山口,2024/11/01,2026/03/13,河内山　瞬平,架空送電Ｂ
2023-CS1879,241-185,110kV宇部厚狭線No.50～52電線張替工事・除却工事,山口・送電第二課,山口,2025/02/05,2025/10/24,前田　拓也,架空送電C
2024-CS0233,241-275,66kV徳山・夜間線No.10～11電線張替工事,周南・送電課,山口,2025/03/17,2025/11/21,山本　浩貴,架空送電C
2023-CS1877,241-309,66kV宇部湾岸線No.11～14電線張替工事,山口・送電第二課,山口,2025/04/16,2025/11/19,弘中　健太,架空送電C
2024-CS0243,243-177,220kV西島根幹線リフレッシュ工事,島根・送電課,島根,2025/03/24,2026/01/23,小川　真,架空送電Ｂ
,251-103,66kV三隅線No.1～11電線張替工事,島根・送電課,島根,2024/12/12,2025/06/13,原田　和幸,架空送電C
2025-CS1878,251-079,66kV美祢・於福線No.1～6電線張替工事,山口・送電第二課,山口,2025/08/18,2027/03/26,藤田　真太郎,架空送電C
,253-121,500kV第２島根原子力幹線リフレッシュ工事,島根・送電課,島根,2025/07/22,2026/05/26,西村　優,架空送電Ｂ
,251-123,66kV防府西・東線№21～23電線張替に伴う試掘工事,広島・送電課,広島,2025/06/11,2025/09/24,畠藤　聖,架空送電C
2024-CS0232,253-126,松江安来線　松江（変）～№11-1電線張替に伴う計画調査,山陰・送電課,島根,2025/07/29,2027/02/19,泉　誠司,架空送電Ｂ
"2023-CS1794,CS1795",251-137,66kV鋳銭司線２回線化に伴うケーブル布設・接続工事,山口・送電第一課,山口,2025/09/17,2026/09/23,兼田　賢治,地中送電Ｂ
2022-CS0158,251-144,66kV光井線№30～40経年鉄塔建替に伴う管路工事,山口・送電第一課,山口,2025/08/20,2026/03/27,三宅　悠太郎,地中送電Ｂ
,251-130,66kV由宇線直線スリーブ細密点検工事,広島北・送電第二課,広島,2025/09/17,2026/03/24,
,251-194,66kV美祢・于福線No.1～6電線張替工事,山口・送電第二課,山口,2025/08/18,2027/03/26,
`;

export const shainCsvData = `
社員番号,事業所,部署,姓,ミドルネーム,名,姓（フリガナ）,名（フリガナ）,入社日,在籍状況,携帯番号,メールアドレス
T000011,山口支店,工事部,白須,,充啓,,,,在籍中,,shirasu@taguma.co.jp
T000022,山口支店,工事部,河内山,,瞬平,,,,在籍中,,kawachiyama@taguma.co.jp
T000046,山口支店,工事部,弘中,,健太,,,,在籍中,,hironaka@taguma.co.jp
T000112,山口支店,工事部,酒井,,巧海,,,,在籍中,,sakai@taguma.co.jp
T000113,山口支店,工事部,三宅,,悠太郎,,,,在籍中,,miyake@taguma.co.jp
T000127,山口支店,工事部,兼田,,賢治,,,,在籍中,,kaneda@taguma.co.jp
T000160,島根支店,工事部,西村,,優,,,,在籍中,,nishimura@taguma.co.jp
T000163,山口支店,工事部,藤田,,真太郎,,,,在籍中,,fujita@taguma.co.jp
T000195,山口支店,工事部,山本,,浩貴,,,,在籍中,,yamamoto@taguma.co.jp
T000204,広島支店,工事部,畠藤,,聖,,,,在籍中,,hatofuji@taguma.co.jp
T000205,山口支店,工事部,前田,,拓也,,,,在籍中,,maeda@taguma.co.jp
T000188,島根支店,工事部,原田,,和幸,,,,在籍中,,harada@taguma.co.jp
T000191,島根支店,工事部,小川,,真,,,,在籍中,,ogawa@taguma.co.jp
T000206,島根支店,工事部,泉,,誠司,,,,在籍中,,izumi@taguma.co.jp
`;

export const keirekiCsvData = `
経歴ID,社員番号,工事ID,担当業務,従事期間（開始）,従事期間（終了）,経験内容の詳細・備考
1,T000112,231-320,現場代理人,2024/01/19,2026/3/23,安全管理、工程管理を担当
2,T000011,231-444,現場代理人,2024/05/13,2028/3/30,安全管理、工程管理を担当
3,T000113,251-103,現場代理人,2024/12/12,2025/6/13,安全管理、工程管理を担当
4,T000022,241-184,現場代理人,2024/11/1,2026/3/13,安全管理、工程管理を担当
5,T000205,241-185,現場代理人,2025/02/05,2025/10/24,安全管理、工程管理を担当
6,T000195,241-275,現場代理人,2025/03/17,2025/11/21,安全管理、工程管理を担当
7,T000046,241-309,現場代理人,2025/04/16,2025/11/19,安全管理、工程管理を担当
8,T000191,243-177,現場代理人,2025/03/24,2026/01/23,安全管理、工程管理を担当
42,T000188,251-103,現場代理人,2024/12/12,2025/6/13,安全管理、工程管理を担当
43,T000163,251-079,現場代理人,2025/08/18,2027/03/26,安全管理、工程管理を担当
44,T000160,253-121,現場代理人,2025/07/22,2026/05/26,安全管理、工程管理を担当
45,T000204,251-123,現場代理人,2025/06/11,2025/09/24,安全管理、工程管理を担当
46,T000206,253-126,現場代理人,2025/07/29,2027/02/19,安全管理、工程管理を担当
47,T000127,251-137,現場代理人,2025/09/17,2026/09/23,安全管理、工程管理を担当
48,T000113,251-144,現場代理人,2025/08/20,2026/03/27,安全管理、工程管理を担当
49,T000112,251-130,現場代理人,2025/09/17,2026/03/24,安全管理、工程管理を担当
50,T000127,251-194,現場代理人,2025/08/18,2027/03/26,安全管理、工程管理を担当
`;
